Revit 2027 API
FamilyParameterSet.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	FamilyParameter item
)
Public Overridable Function Insert (
	item As FamilyParameter
) As Boolean
public:
virtual bool Insert(
	FamilyParameter^ item
)
abstract Insert :
        item : FamilyParameter -> bool
override Insert :
        item : FamilyParameter -> bool
Parameters
item FamilyParameter
Return Value
Boolean
See Also
Reference
FamilyParameterSet Class
Autodesk.Revit.DB Namespace